<template><div><h2 id="是什么" tabindex="-1"><a class="header-anchor" href="#是什么" aria-hidden="true">#</a> 是什么？</h2>
<p>该项目主要记录了本人在计算机技术学习道路上的收获和总结，自己对知识的学习笔记和总结，在步入职场以后也会记录自己在工作中遇到的各种问题，以及最后的解决方案，不仅如此还会记录自己在学习生活中的一些感想感悟，一些自己的思考和想法。</p>
<p>随着时间的变迁，在不同的人生阶段对于同一个事物的看法是不同的，故此所有的知识点也仅代表了当前时刻自己对知识的掌握，会不断对知识进行迭代更新，以便于形成自己的知识体系。</p>
<h2 id="为什么" tabindex="-1"><a class="header-anchor" href="#为什么" aria-hidden="true">#</a> 为什么？</h2>
<div class="hint-container tip">
<p class="hint-container-title">提示</p>
<p>目前在互联网上有很多大佬开源了他们的学习笔记，做的堪称完美，那么为什么不去直接使用他们整理好的学习笔记呢？为什么要反复造一些质量并不高的轮子呢？</p>
</div>
<ul>
<li>结合自己的想法</li>
</ul>
<p>做笔记其实并不是需要一步到位，十分完美且科学，如果以做出完美的笔记为目的，那么各类官方文档是不是更为权威呢？所有的技术和知识点笔记都是基于官方文档展开编写的，也不见得这些笔记没有价值。</p>
<p>自己写总结的目的是为了记录自己对知识点的掌握程度，在未来的发展过程中不断的巩固，从而形成一个自己熟悉且较为完备的知识体系。盖好一栋大厦的关键在于打好地基，但后期的维护和补丁也不可或缺，做笔记并不是目的，目的是为了掌握知识点。</p>
<ul>
<li>更好的记忆与吸收知识</li>
</ul>
<p>知识只有被系统性的归纳起来，才能建立起知识体系，碎片化、零散化地去学习，会让自己陷入一种自我麻痹且极度自信的状态，会让你产生一种所有知识都懂假象，随便提起来一些知识点也都能说上两嘴，但是不能深究，一旦深入一点，就好像缓存穿透一般，所有的刨根问底都造成了真实伤害。</p>
<div class="hint-container info">
<p class="hint-container-title">缓存穿透</p>
<p>是指查询一个根本不存在的数据，缓存层和持久层都不会命中。在日常工作中出于容错的考虑，如果从持久层查不到数据则不写入缓存层，缓存穿透将导致不存在的数据每次请求都要到持久层去查询，失去了缓存保护后端持久的意义。</p>
</div>
<h2 id="参考与鸣谢" tabindex="-1"><a class="header-anchor" href="#参考与鸣谢" aria-hidden="true">#</a> 参考与鸣谢</h2>
<p>本项目中的内容除了自己的日常学习、工作总结，也不乏来源于互联网，并非所有内容都是本人原创，但也绝不是简单的复制粘帖，本人根据互联网上的资料加上本人对知识的理解，总结的一份有自己思考成分的笔记。</p>
<p>在对参考的部分，会给出参考的地址，方便自己或者读者进行知识追溯，也希望其他人在对本人文章进行参考时，也加上文章的来源，保证读者能够对知识点进行刨根问题，追究源头。</p>
<p>也希望读者朋友们保持一个批判性思维，本人所写的所有内容也并非100%正确，可能也会有对知识的误解和遗漏、错误等情况，希望读者们不吝赐教，能够指出文章中一些能够完美，但时并未做到完美的点，也能够后续的读者展现出更高质量的文章，非常感谢大家的支持！</p>
</div></template>


